// Задача №6. Напишите программу, которая на вход принимает число и выдает, является ли число чётным

int number = 7; // -3, 4
if (number % 2 == 0)
{
    Console.WriteLine("Является чётным");
}
else
{
    Console.WriteLine("Не является чётным");
}