// Задача №2. Напишите программу, которая на вход принимает два числа и выдает, какое число большее, а какое меньшее


int a = -9; // 2, 5 
int b = -3; // 7, 10
int max = a;

if (max > b)
{
    Console.WriteLine(max);
}
else
{
    max = b;
    Console.WriteLine(max);
}




